УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/смартЗаявкаНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЗаявкаНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <basedOn>Document.смартЗаявкаНаРемонтныеРаботы</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <registerRecords>AccumulationRegister.смартОборудованиеКРазборке</registerRecords>
  <registerRecords>AccumulationRegister.смартЗаявкиНаРазборкуОборудования</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.смартЗаявкаНаРемонтныеРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереместитьСоСклада</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаРазбора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Командировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.смартСтатусыСогласованияЗаявокНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КВыполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРазборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелПереместитьНаСклад</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСнятаяЗапаснаяЧасть</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПолученныйУзел</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНаЗаменуСнятойЗапаснойЧасти</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаНеТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <comment>#1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования</comment>
    <attributes>
      <name>АртикулСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереместитьНаСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаказывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера2</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Назначения</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <type>
      <types>EnumRef.ТипыНазначений</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудованиеТипНазначения</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>EnumRef.смартТипыНазначенийРазобранногоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудование</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудованиеСерия</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудованиеУзел</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПричинаВыводаИзОборота</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>EnumRef.смартПричиныВыводаТоваровИзОборота</types>
    </type>
  </attributes>
  <attributes>
    <name>смартУточнениеПричиныВыводаИзОборота</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВыведеннаяИзОборотаНоменклатура</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВыведеннаяИзОборотаСерия</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/ВнешниеПользователи/ВнешниеПользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеПользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектАвторизации</name>
    <type>
      <types>DefinedType.ВнешнийПользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьРолиНепосредственно</name>
    <comment>Используется, если не встроена подсистема &quot;Управление доступом&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка); 
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаЗаявкиНаРазборкуОборудования(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры);

	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ";
	
	Для Каждого Реквизит Из Метаданные.Документы.смартЗаявкаНаРазборкуОборудования.СтандартныеРеквизиты Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	" + Реквизит.Имя + " КАК " + Реквизит.Имя + ",";
		
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.Документы.смартЗаявкаНаРазборкуОборудования.Реквизиты Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	" + Реквизит.Имя + " КАК " + Реквизит.Имя + ",";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "ИЗ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ",ИЗ", Символы.ПС + "ИЗ" + Символы.ПС);
	
	Запрос.Текст = Запрос.Текст + "
	|	Документ.смартЗаявкаНаРазборкуОборудования
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	Реквизиты = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Колонка Из Реквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[0][Колонка.Имя]); 
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Период", Реквизиты[0].Дата);
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());
	
КонецПроцедуры  

Функция ТекстЗапросаТаблицаЗаявкиНаРазборкуОборудования(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартЗаявкиНаРазборкуОборудования";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК Заявка,
	|	&Номенклатура КАК Номенклатура,
	|	&Серия КАК Серия,
	|	1 КАК КРазборке,
	|	0 КАК КПолучению
	|
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК Заявка,
	|	Номенклатура КАК Номенклатура,
	|	&Серия КАК Серия, 
	|	0 КАК КРазборке,
	|	Количество КАК КПолучению
	|ИЗ
	|	Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И &КВыполнению И НЕ &Отменена	
	|	
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК Заявка,
	|	&Узел КАК Номенклатура,
	|	&Серия КАК Серия,
	|	0 КАК КРазборке,
	|	1 КАК КПолучению
	|
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена	
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартОборудованиеКРазборке";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 				КАК Период,
	|	&Ссылка 				КАК Заявка,
	|	&Номенклатура 			КАК Номенклатура,
	|	&Серия 					КАК Серия,
	|	&ПереместитьСоСклада 	КАК Склад,
	|	&Склад 					КАК СкладПолучатель,
	|	&Назначение 			КАК Назначение,
	|	0 						КАК КРазборке,
	|	0 						КАК КПолучению,
	|	1 						КАК КПеремещению
	|
	|ГДЕ 
	|	&КВыполнению И НЕ &Отменена
	|	И НЕ &ПереместитьСоСклада = &ПустойСклад
	|	И НЕ &ПереместитьСоСклада = &Склад
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 				КАК Период,
	|	&Ссылка 				КАК Заявка,
	|	&Узел 					КАК Номенклатура,
	|	&Серия 					КАК Серия,
	|	&Склад 					КАК Склад,
	|	&УзелПереместитьНаСклад КАК СкладПолучатель,
	|	&Назначение 			КАК Назначение,
	|	0 						КАК КРазборке,
	|	0 						КАК КПолучению,
	|	1 						КАК КПеремещению
	|
	|ГДЕ 
	|	&КВыполнению И НЕ &Отменена
	|	И НЕ &УзелПереместитьНаСклад = &ПустойСклад
	|	И НЕ &УзелПереместитьНаСклад = &Склад
	|	
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 		КАК Период,
	|	&Ссылка 		КАК Заявка,
	|	&Номенклатура 	КАК Номенклатура,
	|	&Серия 			КАК Серия,
	|	&Склад 			КАК Склад,
	|	&ПустойСклад 	КАК СкладПолучатель,
	|	&Назначение 			КАК Назначение,
	|	1 				КАК КРазборке,
	|	0 				КАК КПолучению,
	|	0 				КАК КПеремещению
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 		КАК Период,
	|	&Ссылка 		КАК Заявка,
	|	&Узел 			КАК Номенклатура,
	|	&Серия 			КАК Серия,
	|	&Склад 			КАК Склад,
	|	&ПустойСклад 	КАК СкладПолучатель,
	|	&Назначение 	КАК Назначение,
	|	0 				КАК КРазборке,
	|	1 				КАК КПолучению,
	|	0 				КАК КПеремещению
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 		КАК Период,
	|	&Ссылка 		КАК Заявка,
	|	Номенклатура 	КАК Номенклатура,
	|	&Серия 			КАК Серия,
	|	&Склад 			КАК Склад,
	|	&ПустойСклад 	КАК СкладПолучатель,
	|	&Назначение 	КАК Назначение,
	|	0 				КАК КРазборке,
	|	Количество 		КАК КПолучению,
	|	0 				КАК КПеремещению
	|ИЗ
	|	Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие
	|	
	|ГДЕ 
	|	Ссылка = &Ссылка	
	|	И &КВыполнению 
	|	И НЕ &Отменена	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 			КАК Период,
	|	&Ссылка 			КАК Заявка,
	|	Номенклатура 		КАК Номенклатура,
	|	&Серия 				КАК Серия,
	|	&Склад 				КАК Склад,
	|	ПереместитьНаСклад 	КАК СкладПолучатель,
	|	&Назначение 		КАК Назначение,
	|	0 					КАК КРазборке,
	|	0		 			КАК КПолучению,
	|	Количество			КАК КПеремещению
	|ИЗ
	|	Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие
	|	
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И &КВыполнению 
	|	И НЕ &Отменена
	|	И НЕ ПереместитьНаСклад = &ПустойСклад 
	|	И НЕ ПереместитьНаСклад = &Склад 
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьСсылкуНаЗаявкуПоОснованию(ДокументСсылка, ВсеЗаявки = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение")
			Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
			
		//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
		Заявка = ?(ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования"),
					ДокументСсылка.ДокументОснование,
					Документы.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка());
		
		Если ВсеЗаявки = Неопределено Тогда
			Возврат Заявка;
		Иначе
			Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заявка);
		КонецЕсли;
		//-- #Б2138 смарт: Шляпников 19.02.2025
			
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаРазборку.Ссылка КАК Заявка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Перемещение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказыНаПеремещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРазборкуОборудования КАК ЗаявкиНаРазборку
	|		ПО
	|			ЗаявкиНаРазборку.Ссылка = ЗаказыНаПеремещение.ДокументОснование
	|			И ЗаявкиНаРазборку.Проведен
	|	ПО
	|		ЗаказыНаПеремещение.Ссылка = Перемещение.ЗаказНаПеремещение
	|		И ЗаказыНаПеремещение.Проведен
	|ГДЕ
	|	Перемещение.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ
	|       
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаРазборку.Ссылка КАК Заявка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказыНаСборку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРазборкуОборудования КАК ЗаявкиНаРазборку
	|		ПО
	|			ЗаявкиНаРазборку.Ссылка = ЗаказыНаСборку.ДокументОснование
	|			И ЗаявкиНаРазборку.Проведен
	|	ПО
	|		ЗаказыНаСборку.Ссылка = СборкаТоваров.ЗаказНаСборку
	|		И ЗаказыНаСборку.Проведен
	|ГДЕ
	|	СборкаТоваров.Ссылка = &ДокументСсылка
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	//|	И СборкаТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|
	|ОБЪЕДИНИТЬ
	|       
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Назначения.Заказ КАК Заявка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|	ПО Товары.Назначение = Назначения.Ссылка
	|		И Назначения.Заказ ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|		И НЕ Назначения.Заказ = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка)
	|ГДЕ
	|	Товары.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ
	|       
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Назначения.Заказ КАК Заявка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|	ПО Товары.Назначение = Назначения.Ссылка
	|		И Назначения.Заказ ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|		И НЕ Назначения.Заказ = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка)
	|ГДЕ
	|	Товары.Ссылка = &ДокументСсылка";
	
	МассивЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");
	
	Возврат ?(ВсеЗаявки = Неопределено, 
			  ?(МассивЗаявок.Количество() > 0, МассивЗаявок[0], Документы.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка()),
			  МассивЗаявок);
	//-- #Б2138 смарт: Шляпников 19.02.2025
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Склад)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = ЭтотСписок.Партнер
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|	ПО КонтактныеЛицаПартнеров.Владелец = ЭтотСписок.Партнер
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиКонтактныеЛица
	|	ПО ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации = КонтактныеЛицаПартнеров.Ссылка
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)
	|	ИЛИ ЗначениеРазрешено(ВнешниеПользователиКонтактныеЛица.Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

КонецПроцедуры

#КонецОбласти 

#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ВводНаОсновании

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
// Добавляет команду создания документа "Заявка на разборку оборудования (смарт)".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.смартЗаявкаНаРазборкуОборудования) Тогда

		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.смартЗаявкаНаРазборкуОборудования.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.смартЗаявкаНаРазборкуОборудования);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции //-- #1989 смарт: Лопато 15.08.2024

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Задачи.ЗадачаИсполнителя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЗаказНаПеремещение.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЗаказНаСборку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры //-- #1989 смарт: Лопато 15.08.2024

#КонецОбласти

#Область Назначения

//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
// Возврашает шаблон для генерации назначения товаров в документе.
//
// Параметры:
// 		Объект - ДокументОбъект.ЗаказКлиента, ДанныеФормыСтруктура - заказ клиента, по которому необходимо получить шаблон назначения.
//
// Возвращаемое значение:
// 		Структура - (см. функцию Справочники.Назначения.ШаблонНового).
//
Функция ШаблонНазначения(Объект, ЧтоПроизошло) Экспорт
	
	ШаблонНазначения = Справочники.Назначения.ШаблонНового();
	ШаблонНазначения.Заказ = Объект.Ссылка;
	ШаблонНазначения.смартРазобранноеОборудованиеТипНазначения = ЧтоПроизошло;
	ШаблонНазначения.смартРазобранноеОборудование = Объект.Номенклатура;
	ШаблонНазначения.смартРазобранноеОборудованиеСерия = Объект.Серия;
	ШаблонНазначения.смартРазобранноеОборудованиеУзел = Объект.Узел;
	
	Возврат ШаблонНазначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
